Tekla Open API Reference for Tekla Structures 2025
Edge.EdgeTypeEnum Enumeration
 The type of the edge.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EdgeTypeEnum
Public Enumeration EdgeTypeEnum
Members
Member name | Value | Description
EDGE_TYPE_NORMAL | 0 |  The normal edge type.
EDGE_TYPE_CURVED_SURFACE | 1 |  The curved surface edge type.
EDGE_TYPE_HIDDEN | 2 |  The hidden edge type.
See Also
Reference
Tekla.Structures.Solid Namespace